mtguerreiro/stm32f103xx_drivers/libs/nrf24l01.c
/*
 * nrf24l01.c
 *
 *  Created on: Dec 9, 2018
 *      Author: Marco
 */

#ifdef NRF24L01_H_
//=============================
/*--------- Includes --------*/
//=============================
#include "nrf24l01.h"

#include <stdint.h>

/* Kernel */
#include "FreeRTOS.h"
#include "semphr.h"

/* Drivers */
#include "spi.h"
#include "gpio.h"
//=============================

#define configNRF24L01_CE_PORT		GPIOB
#define configNRF24L01_CE_PIN		GPIO_P0

#define configNRF24L01_CSN_PORT		GPIOB
#define configNRF24L01_CSN_PIN		GPIO_P1

#define configNRF24L01_IRQ_PORT		GPIOB
#define configNRF24L01_IRQ_PIN		GPIO_P3

#define configNRF24L01_CE_SET		gpioOutputSet(configNRF24L01_CE_PORT, configNRF24L01_CE_PIN)
#define configNRF24L01_CE_RESET		gpioOutputReset(configNRF24L01_CE_PORT, configNRF24L01_CE_PIN)

#define configNRF24L01_CSN_SET		gpioOutputSet(configNRF24L01_CSN_PORT, configNRF24L01_CSN_PIN)
#define configNRF24L01_CSN_RESET	gpioOutputReset(configNRF24L01_CSN_PORT, configNRF24L01_CSN_PIN)


//=============================
/*-------- Prototypes -------*/
//=============================
//-----------------------------
static void nrf24l01PortInitialize(void);
//-----------------------------
static void nrf24l01EXTIInitialize(void);
//-----------------------------
static uint8_t nrf24l01ReadRegisterSingle(uint8_t reg, uint8_t *buffer);
//-----------------------------
static uint8_t nrf24l01ReadRegisterMultiple(uint8_t reg, uint8_t *buffer);
//-----------------------------
static uint8_t nrf24l01WriteRegisterSingle(uint8_t reg, uint8_t *buffer);
//-----------------------------
static uint8_t nrf24l01WriteRegisterMultiple(uint8_t reg, uint8_t *buffer);
//-----------------------------
/* Transmitting/receiving functionalities */
//-----------------------------
/** @brief Transmits a payload to the configured TX address.
 *
 * The transmit payload command is sent, along with the data informed. Since
 * SPI transmits and received data simultaneously, all data received while
 * writing to the NRF's register are cleared from the RX queue.
 *
 * Here, data is not actually sent through RF. The payload is only written to
 * the NRF's register. However, actual data transmission should start as soon
 * after the payload is sent.
 *
 * This function is not meant to be used alone, and pending to the IRQ pin
 * should be done right after, to check if data was successfully sent.
 *
 * @param buffer Pointer to buffer containing data to be sent.
 * @param size Number of bytes to transmit.
 * @return 0 if data was sent successfully, 1 if not enough bytes were
 *         received during transmission, which can indicate that
 *         transmission failed.
 *
 */
static uint8_t nrf24l01TransmitPayload(uint8_t *buffer, uint8_t size);
//-----------------------------
/** @brief Receives a payload.
 *
 * The NRF's RX buffer is read. It is necessary to inform the number of butes
 * to be read, which is the same as the configured RX payload size.
 *
 * @param buffer Pointer to buffer that will store the payload bytes. The
 *               pointer's value is not modified by this function.
 * @param size RX payload size.
 *
 * @return 0 if data data was retrieved from the NRF RX buffer, 1 if could
 *         not read data from NRF.
 */
static uint8_t nrf24l01ReceivePayload(uint8_t *buffer, uint8_t size);
//-----------------------------
//=============================

//=============================
/*--------- Globals ---------*/
//=============================
SemaphoreHandle_t nrf24l01Semaphore;
//=============================


//=============================
/*-------- Functions --------*/
//=============================
//-----------------------------
uint8_t nrf24l01Initialize(void){

	if( spiInitialize(SPI1, SPI_CLK_DIV_128) ) return 1;

	nrf24l01PortInitialize();

	nrf24l01Semaphore = xSemaphoreCreateBinary();
	if(nrf24l01Semaphore == NULL) return 2;
	xSemaphoreTake(nrf24l01Semaphore, 0);

	configNRF24L01_CSN_SET;
	configNRF24L01_CE_RESET;

	return 0;
}
//-----------------------------
uint8_t nrf24l01Read(uint8_t *buffer, uint8_t size, uint32_t pendTicks){

    /* Starts listening */
    nr24l01SetCE();

    if( nrf24l01Pend(pendTicks) ){
        /* Nothing received. Stops listening and returns. */
        nr24l01ResetCE();
        return 1;
    }

    /*
     * If the device is in RX mode and the pend returned 0, then we certainly
     * received data. Thus, we just retrieve it from the FIFO and clear the
     * data received flag.
     */
    nrf24l01ReceivePayload(buffer, size);
    nrf24l01StatusClearRXDR();

    /* Stops listening */
    nr24l01ResetCE();

    return 0;
}
//-----------------------------
uint8_t nrf24l01Write(uint8_t *buffer, uint8_t size, uint32_t pendTicks){

    uint8_t nrfStatus;

    nrf24l01TransmitPayload(buffer, size);

    if( nrf24l01Pend(pendTicks) ){
        /*
         * Pend should always return 0, because if transmission fails, it
         * will be due to maximum retries being reached (assuming enough
         * ticks have been provided). Thus, we should never get here. If
         * we do, we'll clear everything related to transmission.
         */
        nrf24l01FlushTX();
        nrf24l01StatusClearMaxRT();
        nrf24l01StatusClearTXDS();
        return 1;
    }

    /*
     * Now, we check the status. If maximum number of retries were reached,
     * we'll flush the TX FIFO and clear the corresponding flag. Else, data
     * was sent and we clear the TXDS flag only.
     * Additionally, if we fail to read the status, we'll just clear it
     * and clear the TX FIFO.
     */
    if( nrf24l01ReadSR(&nrfStatus) ){
        nrf24l01FlushTX();
        nrf24l01StatusClearMaxRT();
        nrf24l01StatusClearTXDS();
        return 2;
    }
    if( nrfStatus & (1 << 4) ){
        /* Maximum number of retries exceeded */
        nrf24l01FlushTX();
        nrf24l01StatusClearMaxRT();
        return 3;
    }

    /* Data sent successfully */
    nrf24l01StatusClearTXDS();

    return 0;
}
//-----------------------------
uint8_t nrf24l01SetRX(uint8_t *address, uint8_t plSize, uint8_t channel){

	/* Enables auto-ack on data pipe 0 */
	if( nrf24l01EnableAA(0x01) ) return 1;

