mtguerreiro/stm32f103xx_drivers/libs/nrf24l01.c
	return 0;
}
//-----------------------------
uint8_t nrf24l01DisableAA(uint8_t pipes){

	uint8_t data;
	uint8_t buffer;

	/* First, we must read the current settings so we don't overwrite them */
	if( nrf24l01ReadRegister(NRF24L01_REG_EN_AA, &data) ) return 1;

	/* Clear pipes */
    data &= (uint8_t)(~pipes);

	/* Writes to NRF register */
	nrf24l01WriteRegister(NRF24L01_REG_EN_AA, &data);

	/* Reads from NRF register to make sure we wrote it correctly */
	nrf24l01ReadRegister(NRF24L01_REG_EN_AA, &buffer);
	if(buffer != data) return 2;

	return 0;
}
//-----------------------------
uint8_t nrf24l01PowerUp(void){

	uint8_t buffer;
	uint8_t data;
	uint32_t k;

    /* First, we must read the current settings so we don't overwrite them */
    if( nrf24l01ReadRegister(NRF24L01_REG_CONFIG, &data) ) return 1;

	data |= 0x02;

    /* Writes to NRF register */
    nrf24l01WriteRegister(NRF24L01_REG_CONFIG, &data);

    /* After powering the device, we must wait around 1.5ms */
    k = 108000 >> 2;
    while(k--);

    /* Reads from NRF register to make sure we wrote it correctly */
    nrf24l01ReadRegister(NRF24L01_REG_CONFIG, &buffer);
    if(buffer != data) return 2;

	return 0;
}
//-----------------------------
uint8_t nrf24l01PowerDown(void){

	uint8_t buffer;
	uint8_t data;

	/* First, we must read the current settings so we don't overwrite them */
	if( nrf24l01ReadRegister(NRF24L01_REG_CONFIG, &data) ) return 1;

	data &= (uint8_t)(~0x02);

	/* Writes to NRF register */
	nrf24l01WriteRegister(NRF24L01_REG_CONFIG, &data);

	/* Reads from NRF register to make sure we wrote it correctly */
	nrf24l01ReadRegister(NRF24L01_REG_CONFIG, &buffer);
	if(buffer != data) return 2;

	return 0;
}
//-----------------------------
uint8_t nrf24l01ReadSR(uint8_t *status){

	uint8_t command;

	/* NOP operation command */
	command = 0xFF;

	configNRF24L01_CSN_RESET;

	spiWrite(SPI1, &command, 1);
	spiWaitTX(SPI1, 0xFFFF);

	configNRF24L01_CSN_SET;

	if( spiRead(SPI1, status, 0) ) return 1;

	return 0;
}
//-----------------------------
uint8_t nrf24l01ReadRegister(uint8_t reg, uint8_t *buffer){

	if( (reg == NRF24L01_REG_RX_ADDR_P0) || (reg == NRF24L01_REG_RX_ADDR_P1) || (reg == NRF24L01_REG_TX_ADDR) ){
		if( nrf24l01ReadRegisterMultiple(reg, buffer) ) return 1;
	}
	else{
		if( nrf24l01ReadRegisterSingle(reg, buffer) ) return 1;
	}

	return 0;
}
//-----------------------------
uint8_t nrf24l01WriteRegister(uint8_t reg, uint8_t *buffer){

	if( (reg == NRF24L01_REG_RX_ADDR_P0) || (reg == NRF24L01_REG_RX_ADDR_P1) || (reg == NRF24L01_REG_TX_ADDR) ){
		if( nrf24l01WriteRegisterMultiple(reg, buffer) ) return 1;
	}
	else{
		if( nrf24l01WriteRegisterSingle(reg, buffer) ) return 1;
	}

	return 0;
}
//-----------------------------
uint8_t nrf24l01StatusClear(void){

	uint8_t data;
	uint8_t buffer;

	data = (0x01U << 4U) | (0x01U << 5U) | (0x01U << 6U);
	nrf24l01WriteRegister(NRF24L01_REG_STATUS, &data);
	nrf24l01ReadRegister(NRF24L01_REG_STATUS, &buffer);

	if(buffer & data) return 1;

	return 0;
}
//-----------------------------
uint8_t nrf24l01StatusClearMaxRT(void){

	uint8_t data;
	uint8_t buffer;

	data = (0x01U << 4U);
	nrf24l01WriteRegister(NRF24L01_REG_STATUS, &data);
	nrf24l01ReadRegister(NRF24L01_REG_STATUS, &buffer);

	if(buffer & data) return 1;

	return 0;
}
//-----------------------------
uint8_t nrf24l01StatusClearTXDS(void){

	uint8_t data;
	uint8_t buffer;

	data = (0x01U << 5U);
	nrf24l01WriteRegister(NRF24L01_REG_STATUS, &data);
	nrf24l01ReadRegister(NRF24L01_REG_STATUS, &buffer);

	if(buffer & data) return 1;

	return 0;
}
//-----------------------------
uint8_t nrf24l01StatusClearRXDR(void){

	uint8_t data;
	uint8_t buffer;

	data = (0x01U << 6U);
	nrf24l01WriteRegister(NRF24L01_REG_STATUS, &data);
	nrf24l01ReadRegister(NRF24L01_REG_STATUS, &buffer);

	if(buffer & data) return 1;

	return 0;
}
//-----------------------------
uint8_t nrf24l01FlushTX(void){

	uint8_t command;

	command = 0xE1;

	configNRF24L01_CSN_RESET;

	spiWrite(SPI1, &command, 1);
	spiWaitTX(SPI1, 0xFFFF);

	configNRF24L01_CSN_SET;

	if( spiRead(SPI1, &command, 0) ) return 1;

	return 0;
}
//-----------------------------
uint8_t nrf24l01FlushRX(void){

	uint8_t command;

	command = 0xE2;

	configNRF24L01_CSN_RESET;

	spiWrite(SPI1, &command, 1);
	spiWaitTX(SPI1, 0xFFFF);

	configNRF24L01_CSN_SET;

	if( spiRead(SPI1, &command, 0) ) return 1;

	return 0;
}
//-----------------------------
void nr24l01SetCE(void){

	configNRF24L01_CE_SET;
}
//-----------------------------
void nr24l01ResetCE(void){

	configNRF24L01_CE_RESET;
}
//-----------------------------
uint8_t nrf24l01Pend(uint32_t ticks){

	if(xSemaphoreTake(nrf24l01Semaphore, ticks) != pdPASS) return 1;

	return 0;
}
//-----------------------------
uint8_t nrf24l01TXPower(uint8_t power){

    uint8_t buffer;
    uint8_t data;

    /* First, we must read the current settings so we don't overwrite them */
    if( nrf24l01ReadRegister(NRF24L01_REG_RF_SETUP, &data) ) return 1;

    data &= (uint8_t)~(0x03 << 1);
    data |= (uint8_t)(power << 1);

    /* Writes to NRF register */
    nrf24l01WriteRegister(NRF24L01_REG_RF_SETUP, &data);

    /* Reads from NRF register to make sure we wrote it correctly */
    nrf24l01ReadRegister(NRF24L01_REG_RF_SETUP, &buffer);
    if(buffer != data) return 2;

    return 0;
    return 0;
}
//-----------------------------
//=============================

//=============================
/*----- Static functions ----*/
//=============================
//-----------------------------
static void nrf24l01PortInitialize(void){

	gpioPortEnable(configNRF24L01_CE_PORT);
	gpioConfig(configNRF24L01_CE_PORT, configNRF24L01_CE_PIN, GPIO_MODE_OUTPUT_10MHZ, GPIO_CONFIG_OUTPUT_GP_PUSH_PULL);

	gpioPortEnable(configNRF24L01_CSN_PORT);
	gpioConfig(configNRF24L01_CSN_PORT, configNRF24L01_CSN_PIN, GPIO_MODE_OUTPUT_10MHZ, GPIO_CONFIG_OUTPUT_GP_PUSH_PULL);

	gpioPortEnable(configNRF24L01_IRQ_PORT);
	gpioConfig(configNRF24L01_IRQ_PORT, configNRF24L01_IRQ_PIN, GPIO_MODE_INPUT, GPIO_CONFIG_INPUT_PULL_UP);

	/* Configures EXTI line 3 as external source */
	nrf24l01EXTIInitialize();
}
//-----------------------------
static void nrf24l01EXTIInitialize(void){

