mtguerreiro/stm32f103xx_drivers/libs/nrf24l01.c
	/* Selects GPIOB pin 3 as external source for line 3 */
	AFIO->EXTICR[0] = (1U << 12);
	/* Interrupt for line 3 is not masked */
	EXTI->IMR |= (1U << 3);
	/* Sets falling edge as trigger for line 2 */
	EXTI->FTSR |= (1U << 3);
	/* Clears pending register */
	EXTI->PR |= (1U << 3);

	/* Sets NVIC priority and enables interrupt */
	NVIC_SetPriority(EXTI3_IRQn, 6);
	NVIC_EnableIRQ(EXTI3_IRQn);
}
//-----------------------------
static uint8_t nrf24l01ReadRegisterSingle(uint8_t reg, uint8_t *buffer){

	uint8_t txBuffer[2];

    txBuffer[0] = reg;
	txBuffer[1] = 0xFF;

	configNRF24L01_CSN_RESET;

	spiWrite(SPI1, txBuffer, 2);
	spiWaitTX(SPI1, 0xFFFF);

	configNRF24L01_CSN_SET;

	/*
	 * While sending two bytes (register + dummy), we also received two
	 * bytes. The first one is the status register. The second byte
	 * should be the register we are trying to read. So we save the first
	 * byte in the buffer, which should be the status register, and then
	 * overwrite it with the second byte, which should be the data we
	 * are looking for.
	 */
	if( spiRead(SPI1, buffer, 0) ) return 1;
	if( spiRead(SPI1, buffer, 0) ) return 2;

	return 0;
}
//-----------------------------
static uint8_t nrf24l01ReadRegisterMultiple(uint8_t reg, uint8_t *buffer){

    uint8_t txBuffer[6] = {0x00};
    uint8_t *rxBuffer;
    uint8_t k;

	txBuffer[0] = reg;

	configNRF24L01_CSN_RESET;

	spiWrite(SPI1, txBuffer, sizeof(txBuffer));
	spiWaitTX(SPI1, 0xFFFF);

	configNRF24L01_CSN_SET;

	/*
	 * While sending six bytes (register + dummies), we also received six
	 * bytes. The first one is the status register. The 2~6 bytes
	 * should be the register we are trying to read. So we save the first
	 * byte in the buffer, which should be the status register, and then
	 * overwrite it with the 2~6 bytes, which should be the data we
	 * are looking for.
	 *
	 * In addition, we save the buffer pointer so we do not modify it.
	 */
	rxBuffer = buffer;
	if( spiRead(SPI1, rxBuffer, 0) ) return 1;
	k = sizeof(txBuffer) - 1;
	while(k--){
		if( spiRead(SPI1, rxBuffer++, 0) ) return 2;
	}

	return 0;
}
//-----------------------------
static uint8_t nrf24l01WriteRegisterSingle(uint8_t reg, uint8_t *buffer){

    uint8_t txBuffer[2];

    txBuffer[0] = reg | 0x20;
    txBuffer[1] = *buffer;

	configNRF24L01_CSN_RESET;

	spiWrite(SPI1, txBuffer, 2);
	spiWaitTX(SPI1, 0xFFFF);

	configNRF24L01_CSN_SET;

	/*
	 * While sending two bytes (register + data), we also received two
	 * bytes. The first one is the status register. The second byte
	 * is undefined. We just clear them.
	 */
	if( spiRead(SPI1, txBuffer, 0) ) return 1;
	if( spiRead(SPI1, txBuffer, 0) ) return 2;

	return 0;
}
//-----------------------------
static uint8_t nrf24l01WriteRegisterMultiple(uint8_t reg, uint8_t *buffer){

	uint8_t k;

	reg |= 0x20;

	configNRF24L01_CSN_RESET;

	spiWrite(SPI1, &reg, 1);
	spiWrite(SPI1, buffer, 5);
	spiWaitTX(SPI1, 0xFFFF);

	configNRF24L01_CSN_SET;

	/*
	 * While sending six bytes (register + data), we also received six
	 * bytes. The first one is the status register. The 2~6 bytes
	 * are undefined. We just clear them.
	 */
	k = 6;
	while(k--){
		if( spiRead(SPI1, &reg, 0) ) return 2;
	}

	return 0;
}
//-----------------------------
static uint8_t nrf24l01TransmitPayload(uint8_t *buffer, uint8_t size){

    uint8_t command;
    uint8_t k;

    configNRF24L01_CSN_RESET;

    command = 0xA0;
    spiWrite(SPI1, &command, 1);
    spiWrite(SPI1, buffer, size);
    spiWaitTX(SPI1, 0xFFFF);

    configNRF24L01_CSN_SET;

    /*
     * A high pulse must be given to CE so transmission can start. This pulse
     * must last at least 10 us. Thus, we set it now and clear it later.
     * */
    configNRF24L01_CE_SET;
    /*
     * While sending the data (command + data), we also received one
     * byte for each byte transmitted. We just clear them.
     */
    k = (uint8_t)(size + 1U);
    while(k--){
        if( spiRead(SPI1, &command, 0) ) return 1;
    }

    configNRF24L01_CE_RESET;

    return 0;
}
//-----------------------------
static uint8_t nrf24l01ReceivePayload(uint8_t *buffer, uint8_t size){

    uint8_t *rxBuffer;
    uint8_t txBuffer[2] = {0x00};
    uint8_t k;

    configNRF24L01_CSN_RESET;

    txBuffer[0] = 0x61;

    /* First, writes the read RX payload command */
    spiWrite(SPI1, &txBuffer[0], 1);
    /* Now, sends 0x00 to provide clock to read the payload from the module */
    k = size;
    while(k--) spiWrite(SPI1, &txBuffer[1], 1);
    spiWaitTX(SPI1, 0xFFFF);

    configNRF24L01_CSN_SET;

    /*
     * While sending the data (command + data), we also received one
     * byte for each byte transmitted. We clear the first one and
     * save the rest.
     *
     * We save the buffer pointer in a local variable to preserve the
     * original pointer's value.
     */
    rxBuffer = buffer;
    if( spiRead(SPI1, txBuffer, 0) ) return 1;
    k = size;
    while(k--){
        if( spiRead(SPI1, rxBuffer++, 0) ) return 1;
    }

    return 0;
}
//-----------------------------
//=============================

//=============================
/*------- IRQ Handlers ------*/
//=============================
//-----------------------------
void EXTI3_IRQHandler(void) __attribute__ ((interrupt ("IRQ")));
void EXTI3_IRQHandler(void){

	BaseType_t xHigherPriorityTaskWoken = pdFALSE;

	EXTI->PR |= (1U << 3);

	xSemaphoreGiveFromISR(nrf24l01Semaphore, &xHigherPriorityTaskWoken);
	if(xHigherPriorityTaskWoken == pdTRUE) portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
}
//-----------------------------
//=============================

#endif
